Revit 2024 API
BuiltInFailures.SketchFailures.InvalidElevationSketchError Property
 Elevation Profile sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidElevationSketchError { get; }
Visual Basic
Public Shared ReadOnly Property InvalidElevationSketchError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidElevationSketchError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace